CREATE TABLE `Product` (
  `PROID` varchar(300) NOT NULL COMMENT '商品ID',
  `PRONAME` varchar(300) NOT NULL COMMENT '商品名稱',
  `PROSTOCK` int NOT NULL COMMENT '商品庫存',
  `PROPRICE` int NOT NULL COMMENT '商品定價',
  `PROSPECS` varchar(300) NOT NULL COMMENT '商品規格',
  `PROBRAND` varchar(300) NOT NULL COMMENT '商品品牌',
  `PROPICTURE` longblob COMMENT '商品圖片',
  `PROCATEGORY` varchar(300) NOT NULL COMMENT '商品類別',
  PRIMARY KEY (`PROID`))
  COMMENT = '產品資訊';
  

INSERT INTO 
	`project`.`Product` (`PROID`, `PRONAME`, `PROSTOCK`, `PROPRICE`, `PROSPECS`, `PROBRAND`, `PROPICTURE`, `PROCATEGORY`) 
VALUES 
	('1', 'MARVIS義大利經典牙膏', '30', '339', '85ml', 'MARVIS ', '?', '牙膏'),
	('2', '舒酸定強化琺瑯質兒童牙膏', '30', '180', '65g', '舒酸定', '?', '牙膏'),
	('3', '舒酸定專業修復牙膏', '30', '180', '100g', '舒酸定', '?', '牙膏'),
	('4', '舒酸定強效抗敏牙膏', '30', '180', '160g', '舒酸定', '?', '牙膏'),
	('5', 'BlackIsWhite酷黑淨白牙刷組', '30', '450', '2支', 'BlackIsWhite', '?', '牙刷'),
	('6', '獅王固齒佳超薄刷頭牙刷', '30', '109', '1支', '獅王', '?', '牙刷'),
	('7', 'EBISU惠比壽3~6歲兒童牙刷', '30', '50', '1支', 'EBISU', '?', '牙刷'),
	('8', '獅王固齒佳酵素漱口水', '20', '365', '450ml', '獅王', '?', '漱口水'),
	('9', '速可淨矯正含氟專用漱口水', '30', '250', '500ml', '速可淨', '?', '漱口水'),
	('10', '獅王NONIO終結口氣漱口水', '20', '158', '600ml', '獅王', '?', '漱口水'),
	('11', '3M護齒霜', '30', '299', '113g', '3M', '?', '牙膏'),
	('12', '獅王固齒佳固齒牙膏', '20', '180', '130g', '獅王', '?', '牙膏'),
	('13', 'Oral-B歐樂B矯正專用牙間刷', '30', '80', '1支', 'Oral-B', '?', '牙刷'),
	('14', 'TePe緹碧矯正專用單頭刷', '30', '135', '1支', 'TePe', '?', '牙刷'),
	('15', 'Oral-B歐樂B便攜型牙縫刷', '20', '189', '1盒', 'Oral-B',' ?', '牙刷'),
	('16', 'Oral-B深層清潔牙線', '20', '145', '1盒', 'Oral-B', '?', '牙線'),
	('17', '日本UFCFLOSSY兒童木醣醇安全牙線棒', '10', '350', '1盒', 'UFCFLOSSY', '?', '牙線'),
	('18', 'maxill(大圈)美適牙橋穿透線', '20', '89', '4包', 'maxill', '?', '牙線'),
	('19', 'maxill(小圈)美適牙橋穿透線', '20', '89', '4包', 'maxill', '?', '牙線'),
	('20', 'Platypus鴨嘴獸矯正用牙線棒', '20', '330', '1包', 'Platypus', '?', '牙線'),
	('21', 'Panasonic國際牌噴射水流攜帶型沖牙機EW-DJ40', '10', '1800', '1台', 'Panasonic', '?', '沖牙機'),
	('22', 'Panasonic國際牌噴射水流沖牙機EW-1613-W', '10', '2900', '1台', 'Panasonic', '?', '沖牙機'),
	('23', 'Panasonic國際牌超音波水流沖牙機EW-1513-W', '10', '2680', '1台', 'Panasonic', '?', '沖牙機'),
	('24', 'Panasonic國際牌無線國際電壓充電式沖牙機EW-1413-H', '10', '2080', '1台', 'Panasonic', '?', '沖牙機'),
	('25', 'DENTCLEAR碧利妥酵素假牙清潔錠', '15', '300', '1盒', 'DENTCLEAR', '?', '清潔類'),
	('26', 'DENTCLEAR碧利妥綠茶假牙清潔錠', '10', '300', '1盒', 'DENTCLEAR', '?', '清潔類'),
	('27', '德恩奈假牙清潔錠', '10', '120', '1盒', '德恩奈', '?', '清潔類'),
	('28', '保麗淨局部假牙清潔錠', '10', '370', '1盒', '保麗淨', '?', '清潔類'),
	('29', '德恩奈口腔護具清潔錠', '10', '200', '1盒', '德恩奈', '?', '清潔類'),
	('30', '速口舒牙菌斑顯示劑', '20', '130', '1瓶', '速口舒', '?', '清潔類');
